EmilioDSantiago/P3_MQTT_PROVISSIONING/source/pin_mux.c
/*
 * Copyright 2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_common.h"
#include "pin_mux.h"
#include "fsl_io_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {                                /*!< Function assigned for the core: Cortex-M33[cm33] */
    IO_MUX_SetPinMux(IO_MUX_FC3_USART_DATA);
    IO_MUX_SetPinMux(IO_MUX_GPIO11);

    /* Initialize SCT_OUT_0 functionality on pin GPIO_3 (pin L4) */
    IO_MUX_SetPinMux(IO_MUX_SCT_OUT_0);
    /* Initialize SCT_OUT_1 functionality on pin GPIO_4 (pin N3) */
    IO_MUX_SetPinMux(IO_MUX_SCT_OUT_1);
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
